{"pages":[{"title":"Tentang Saya","text":"Hai, yang disana 👋 Perkenalkan nama saya Muhammad Febrian atau biasa dipanggil Rian. Saya lulusan dari SMK Negeri 54 Jakarta yang mengambil jurusan Teknik Komputer Jaringan (TKJ). Saya sangat senang tentang dunia teknologi, khusus nya mengenai website. Sekarang sedang tahap belajar mengenai Javascript (Sok sibukin diri aja, hahaha). Tempat Lahir: JakartaTanggal Lahir: 18 Februari 2002Email: muhammadfebriyan86@gmail.comNomor Telepon: +62 838-7496-8672 Emmm, mungkin itu saja yang bisa saya bagikan mengenai perkenalan diri ini. Singkat saja ya, soalnya bingung mau perkenalin diri apa lagi hehehe. Semoga catatan di Blog ini dapat bermanfaat bagi teman-teman semua 😁","link":"/about/index.html"}],"posts":[{"title":"Akhirnya bisa membuat blog sendiri","text":"Bismillahirrahmanirrahim Sedikit curhatan aja hehehe, alhamdulillah akhirnya saya dapat membuat tempat untuk menulis catatan. Dimana sebelumnya saya menulis nya di Medium. Dari dulu berharap mempunyai tempat sendiri untuk menulis, dulu sempat menulis diberbagi platform seperti: WordPress dan Blogger. Sekarang alhamdulillah dapat mempunyai tempat menulis catatan. Awal nya saya ter-inspirasi dari teman-teman di Telegram yang banyak sekali mempunyai tempat blog nya masing-masing. Dimana mereka menuliskan pengalaman mereka dari mulai tutorial, pemecahan masalah, berbagi cerita, dan masih banyak lagi. Tetapi saya saat itu belum mempunyai tekad yang kuat untuk membuat blog sendiri, pada akhirnya saya ter-inspirasi dari website nya pak Rania Amania dan juga blog nya pak BanditHijo. Saya membuat blog ini menggunakan Static Site Generator (SSG) Hexo dan menggunakan tema Icarus (Saya dapat referensi tema ini dari pak Rania, hehe). Sebenarnya ada banyak sekali tema yang tersedia pada hexo, akan tetapi saya masih kurang tertarik. Mungkin itu saja curhatan saya kali ini :”), kedepannya mungkin saya akan menulis catatan di blog ini. Semoga blog ini dapat bermanfaat bagi teman-teman semua, ambil saja point-point yang bermanfaat dan buang jauh-jauh yang tidak bermanfaat :D Terima kasih.","link":"/curhatan/akhirnya-bisa-membuat-blog-sendiri/"},{"title":"Cara hosting website dengan Vercel dan Netlify","text":"Bismillahirrahmanirrahim Pembahasan kali ini, saya akan membagikan cara hosting website static kita menggunakan Vercel dan Netlify agar website yang kita buat dapat dipamerkan atau dilihat oleh orang lain. Dengan menggunakan Vercel ataupun Netlify kita dengan mudah mem-publish atau meng-hosting projek website kita hanya cukup menghubungkan repository yang ada di akun Github kita sendiri, sebenarnya selain Github ada juga seperti Bitbucket dan GitLab, tapi disini aku jelaskan nya menggunakan Github ya. Sesuaikan aja sama yang kamu gunakan. Mari kita mulai :) Persyaratan Mempunyai akun Github (Daftar apabila belum punya) Daftar Download &amp; Install software Git Download Git Mempunyai akun Vercel (Daftar apabila belum punya) Daftar Mempunyai akun Netlify (Daftar apabila belum punya) Daftar Setelah persyaratan nya sudah dilengkapi. Kita mulai dengan Github terlebih dahulu dimana kita membuat repository pada Github lalu di push projek lokal kita ke website nya Github menggunakan Git. Membuat Repository di Github Apabila sudah terdapat repository projek di akun Github kamu, langkah ini bisa kamu lewati. Apabila kamu sudah membuat akun Github, silahkan login dan masuk ke dalam halaman membuat repository baru Buat repository baru Isikan form sesuai aturan, untuk bagian Public atau Private silahkan pilih public dan untuk Initialize this repository with: abaikan saja dulu ya :”). Lalu tekan Create Repository. Lalu akan ada tampilan perintah untuk push ke Github. Untuk itu kita lewati dulu, buka folder projek kamu lalu klik kanan pada mouse dan buka Git (Jika sudah menginstall nya). Di Windows jika klik kanan pada mouse buka yang bertuliskan Git Bash Here Di GNU/Linux bertuliskan Open in Terminal (Saya menggunakan Linux Mint) Di MacOS saya kurang tau hehe (Mungkin sama dengan di GNU/Linux) Kemudian cek versi git mu git --version pada hari ini aku memakai git versi 2.31.1. Selanjutnya saya asumsikan kamu sudah memberikan konfigurasi awal yaitu username dan email, apabila belum kamu bisa lihat di Config Git pada teks To set your global username/email configuration: Oke, setelah configurasi git telah selesai ketikan perintah dibawah ini untuk push ke Github kita:123456git initgit add .git commit -m &quot;first commit&quot;git branch -M maingit remote add origin https://github.com/usernameGithub/nama-repo-kamu.gitgit push -u origin main Silahkan refersh halaman browser Github nya Setelah itu? sudah, untuk membuat repository baru panjang juga ya :”) Hosting dengan Vercel Silahkan buka website Vercel dan login, saya asumsikan kamu sudah daftar dan mempunyai akunnya Klik New Project Lalu pilih Continue with Github dan akan meminta perizinan untuk menginstall vercel. Disini kamu disuruh pilih All repositoriess atau Only select repositories, disini saya All repositories. Lalu install, dan nanti akan ada repo yang telah kita buat sebelumnya di Github (repo projek kamu). Klik Import pada repo tersebut. Lalu dibagian Select Vercel Scope disini saya memilih personal account, karena kita belum ada team dan ini hanya untuk latihan sederhana saja ya :”) Lalu tekan continue Berhubung website yang di deploy sederhana, kita tidak perlu ubah-ubah lagi. Langsung deploy aja. Dan tunggu….. Ini website yang telah saya buat dengan hosting Vercel di https://cara-hosting-vercel-dan-netlify.vercel.app/. Gimana website temen-temen, huff panjang juga yak hahaha. Kalo ada kendala bisa japri saya di Telegram Rian dan bisa juga pamerin website temen-temen semua. Okee, deploy dengan vercel sudah kelar :”. Selanjut nya kita deploy dengan netlify, let’s go bruhhhh…. Hosting dengan Netlify Silahkan buka website Netlify dan login, saya asumsikan kamu sudah daftar dan mempunyai akunnya Lalu tekan tombol New site from Git, setelah itu pilih Github (sesuaikan saja jika kamu pengguna selain Github) Otomatis akan membuka popup browser baru untuk meminta Authorized Setelah itu akan muncul repo yang tersimpan di Github kita, pilih repo projek kamu Karena kita hanya web static saja yang sederhana. Tekan langsung pada tombol Deploy site dibawah, lalu tunggu….. Jika ada pesan published artinya website kita sudah dapat diakses oleh orang lain, namun disini nama website kita masih aneh Untuk mengatasi itu kamu klik bagian Domain settings, scroll sedikit kebawah klik bagian options dan Edit site name Edit nama domain nya sesuai keinginan kamu, lalu save Dan domain akan berubah sesuai input yang kamu edit dan domain sebelumnya tidak bisa kamu akses lagi, kamu bisa cek website yang saya buat ini dengan hosting dari Netlify di https://cara-hosting-vercel-dan-netlify.netlify.app/ Hummmm…. Panjang juga ya? gapapa lah ya hehe, baca nya disesuai kebutuhan aja. Jika ingin hosting dengan Netlify bagian Vercel bisa kamu lewati begitupun sebaliknya jika kamu ingin hosting dengan Vercel. Mungkin itu saja yang dapat saya bagikan, apabila ada saran dan kritik berikan di kolom komentar atau japri saya via Telegram Rian. Terima kasih semua, semoga dapat bermanfaat :D","link":"/tutorial/hosting-web-dengan-vercel-dan-netlify/"},{"title":"Membuat Program Penjualan Barang dengan Javascript","text":"Bismillahirrahmanirrahim Sebelumnya ada seseorang yang nge-chat saya di Telegram mengenai tugas nya yang diberikan dosen nya. Dimana tugas nya adalah membuat program penjualan barang yang cara kerja nya adalah ketika kita meng-centang atau menge-check nama barang artinya kita menjual barang tersebut dan jika kita memasukkan nilai jumlah beli, sama saja seperti dikali sesuai yang kita masukkan di kolom input. Hemm bingung ya?, gini deh. Jadi disini terdapat 3 barang, yaitu Handphone, Laptop, dan Komputer. Dimana masing-masing barang terdapat nilai atau harga barang tersebut adalah. Handphone = 1200000 (1,2 Juta Rupiah) Laptop = 5000000 (5 Juta Rupiah) Komputer = 3000000 (3 Juta Rupiah) Dimana nanti akan dikalikan dengan input-an pada jumlah beli. Yang nanti nya ketika kita meng-klik tombol Proses akan tampil hasil nya input-an Total Harga yang dimana akan dilakukan penjumlahan pada masing-masing barang yang dipilih, Jadi cara kerja nya jika kita menjual Laptop dan Komputer misalnya, kita meng-centang atau memilih pada barang tersebut lalu kita masukkan jumlah beli 2 pada input-an jumlah beli laptop dan komputer, itu artinya 5000000 (Harga Laptop) * 2 = 10000000 (10 Juta Rupiah) dan 3000000 (Harga Komputer) * 2 = 6000000 (6 Juta Rupiah). Hasil dari perkalian barang ini akan dilakukan penjumalahan 10000000 (10 Juta Rupiah) + 6000000 (6 Juta Rupiah) = 16000000 (16 Juta Rupiah). Yang nanti 16000000 akan ditampilkan pada input-an Total Harga. Jadi, studi kasus disini adalah Apabila kita memasukkan pada jumlah beli akan tetapi tidak meng-centang atau memilih barang nya, akan menampilkan pesan pemberitahuan Apabila ada ada barang yang tidak ikut tercentang maka tidak akan ikut dilakukan nya penjumlahan Apabila barang yang sudah terpilih lalu dimasukkan nilai jumlah beli, maka harga barang tersebut akan dikalikan sesuai nilai yang dimasukkan Apabila ada barang yang dipilih tapi belum memasukkan nilai jumlah beli, maka Total Harga akan 0 Apabila menekan tombol Reset maka semua akan kembali kekeadaan awal Kalo teman-teman sudah paham tentang studi kasus nya, coba dibuat sendiri dan hasilnya jangan lupa kirim ke saya via Telegram Rian. Oke, let’s go kita buat bareng-bareng aja ya, pertama bikin terlebih dahulu file HTML nya, disini file html saya bernama index.html, selanjut nya buat file CSS kita, disini saya buat nama file nya style.css dan file Javascript yang dimana saya kasih nama main.js. Perhatikan Ekstensi setelah titik (.) pada penamaan file Setelah membuat ketiga file tersebut, selanjutnya kita menuliskan kode nya, untuk kode pada HTML nya: index.html123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657&lt;!DOCTYPE html&gt;&lt;html lang=&quot;en&quot;&gt; &lt;head&gt; &lt;meta charset=&quot;UTF-8&quot; /&gt; &lt;meta http-equiv=&quot;X-UA-Compatible&quot; content=&quot;IE=edge&quot; /&gt; &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1.0&quot; /&gt; &lt;title&gt;PROGRAM PENJUALAN BARANG&lt;/title&gt; &lt;/head&gt; &lt;body&gt; &lt;form name=&quot;form&quot;&gt; &lt;table&gt; &lt;tr&gt; &lt;th colspan=&quot;2&quot;&gt;PROGRAM PENJUALAN BARANG&lt;/th&gt; &lt;/tr&gt; &lt;tr&gt; &lt;th&gt;NAMA BARANG&lt;/th&gt; &lt;th&gt;JUMLAH BELI&lt;/th&gt; &lt;/tr&gt; &lt;tr&gt; &lt;td&gt; &lt;label&gt; &lt;input type=&quot;checkbox&quot; class=&quot;handphone&quot; /&gt; &lt;/label&gt;Handphone &lt;/td&gt; &lt;td&gt;&lt;input type=&quot;text&quot; class=&quot;jumlahBeliHp&quot; /&gt;&lt;/td&gt; &lt;/tr&gt; &lt;tr&gt; &lt;td&gt; &lt;label&gt; &lt;input type=&quot;checkbox&quot; class=&quot;laptop&quot; /&gt; &lt;/label&gt;Laptop &lt;/td&gt; &lt;td&gt;&lt;input type=&quot;text&quot; class=&quot;jumlahBeliLaptop&quot; /&gt;&lt;/td&gt; &lt;/tr&gt; &lt;tr&gt; &lt;td&gt; &lt;label&gt; &lt;input type=&quot;checkbox&quot; class=&quot;komputer&quot; /&gt; &lt;/label&gt;Komputer &lt;/td&gt; &lt;td&gt;&lt;input type=&quot;text&quot; class=&quot;jumlahBeliKomputer&quot; /&gt;&lt;/td&gt; &lt;/tr&gt; &lt;tr&gt; &lt;td&gt; &lt;label&gt; TOTAL HARGA &lt;/label&gt; &lt;/td&gt; &lt;td&gt;&lt;input type=&quot;text&quot; id=&quot;total&quot; disabled /&gt;&lt;/td&gt; &lt;/tr&gt; &lt;tr&gt; &lt;td&gt;&lt;input type=&quot;button&quot; value=&quot;Proses&quot; /&gt;&lt;/td&gt; &lt;td&gt;&lt;input type=&quot;reset&quot; value=&quot;Reset&quot; /&gt;&lt;/td&gt; &lt;/tr&gt; &lt;/table&gt; &lt;/form&gt; &lt;p&gt; Catatan: &lt;br /&gt; Harga 1 Handphone = 1200000, &lt;br /&gt; Harga 1 Laptop = 5000000, &lt;br /&gt; Harga 1 Komputer = 3000000 &lt;/p&gt; &lt;/body&gt;&lt;/html&gt; Setelah itu tuliskan kode berikut pada CSS kalian: style.css12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152@import url('https://fonts.googleapis.com/css2?family=Montserrat:wght@400;700&amp;display=swap');* { margin: 0; padding: 0; box-sizing: border-box;} body { font-family: 'Montserrat', sans-serif; background-color: #555;}table { padding: 15px; margin: 40px auto; color: #333; width: 550px; border: 4px solid rgb(50, 224, 79); background-color: #fff; box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.2);}th,td { border: 2px solid #333;}th,td { padding: 10px;}input[type='text'] { width: 100%; padding: 5px;}input[type='button'],input[type='reset'] { padding: 5px 10px; margin: auto; display: block;}p { color: #fff; width: 550px; margin: auto; font-weight: 700;} Dan yang terakhir adalah javascript, silahkan kalian tulis kode berikut pada file javascript kalian: main.js12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061// Untuk HPlet hp = document.querySelector('.handphone');const jmlHp = document.querySelector('.jumlahBeliHp');// Untuk Laptoplet laptop = document.querySelector('.laptop');const jmlLaptop = document.querySelector('.jumlahBeliLaptop');// Untuk Komputerlet komputer = document.querySelector('.komputer');const jmlKomputer = document.querySelector('.jumlahBeliKomputer');// Hasilconst hasil = document.querySelector('#total');// Ketika tombol proses ditekanconst proses = document.querySelector('input[type=&quot;button&quot;]');proses.addEventListener('click', function () { // Kalo barang gak ada yang di check tampilkan alert if (hp.checked === false &amp;&amp; laptop.checked === false &amp;&amp; komputer.checked === false) { alert('Check barang terlebih dahulu!'); } // Kalo barang hp di check maka akan dikali dengan jumlah barang yang di beli let hargaHp = 1200000; // Harga awal HP, sudah kita tentukan if (hp.checked === true) { hargaHp *= jmlHp.value; hasil.value = hargaHp; } // Kalo barang laptop di check maka akan dikali dengan jumlah barang yang di beli let hargaLaptop = 5000000; // Harga awal Laptop, sudah kita tentukan if (laptop.checked === true) { hargaLaptop *= jmlLaptop.value; hasil.value = hargaLaptop; } // Kalo barang komputer di check maka akan dikali dengan jumlah barang yang di beli let hargaKomputer = 3000000; // Harga awal Komputer, sudah kita tentukan if (komputer.checked === true) { hargaKomputer *= jmlKomputer.value; hasil.value = hargaKomputer; } // Kalo semua barang di check maka akan dijumlahkan harga nya dan ditampilkan ke hasil value atau ke bagian input Total Harga if (hp.checked === true &amp;&amp; laptop.checked === true &amp;&amp; komputer.checked === true) { hasil.value = hargaHp + hargaLaptop + hargaKomputer; // Kalo yang di check cuman barang hp dan laptop saja, maka akan dijumlahkan harga hp dan laptop saja } else if (hp.checked === true &amp;&amp; laptop.checked === true) { hasil.value = hargaHp + hargaLaptop; // Kalo yang di check cuman barang hp dan komputer saja, maka akan dijumlahkan harga hp dan komputer saja } else if (hp.checked === true &amp;&amp; komputer.checked === true) { hasil.value = hargaHp + hargaKomputer; // Kalo yang di check cuman barang laptop dan komputer saja, maka akan dijumlahkan harga laptop dan komputer saja } else if (laptop.checked === true &amp;&amp; komputer.checked === true) { hasil.value = hargaLaptop + hargaKomputer; }}); Coba kalian jalankan di browser, apakah sudah sesuai atau belum. Jika ada error silahkan tanya di kolom komentar atau japri via Telegram Rian. Mungkin itu saja yang bisa saya bagikan, mungkin juga teman-teman bisa membuat nya lebih ringkas lagi atau di refactoring agar kode nya terlihat pendek dan bersih. Saya juga masih belajar tentang Javascript ini, makanya saya senang ada pertanyaan yang mengacu kepada javascript apalagi ada studi kasus nya membuat saya terus mengasah kemampuan tentang javascript ini. Apabila ada kekurangan mohon dimaafkan :”) Untuk Melihat Demo Program nya Demo-Program","link":"/tutorial/membuat-program-penjualan-barang/"}],"tags":[{"name":"perkenalan","slug":"perkenalan","link":"/tags/perkenalan/"},{"name":"curhatan","slug":"curhatan","link":"/tags/curhatan/"},{"name":"hosting","slug":"hosting","link":"/tags/hosting/"},{"name":"website","slug":"website","link":"/tags/website/"},{"name":"vercel","slug":"vercel","link":"/tags/vercel/"},{"name":"netlify","slug":"netlify","link":"/tags/netlify/"},{"name":"html","slug":"html","link":"/tags/html/"},{"name":"css","slug":"css","link":"/tags/css/"},{"name":"js","slug":"js","link":"/tags/js/"}],"categories":[{"name":"curhatan","slug":"curhatan","link":"/categories/curhatan/"},{"name":"tutorial","slug":"tutorial","link":"/categories/tutorial/"}]}